Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_Задача/ЦБР_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_Задача</name>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ВидЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратитьВнимание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредСогласованныеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительЗадачи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стартовала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзялиВРаботу</name>
    <comment>Истина = Руководитель проверил и взял задачу в работу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипЗадачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команда</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.ЦБР_РольВЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.ЦБР_Конфигурации1С</types>
        <types>CatalogRef.cbr_Конфигурации1С</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Релиз</name>
      <type>
        <types>EnumRef._центрСостояниеРелизовКонфигураций</types>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеКонфигурации</name>
      <type>
        <types>EnumRef._центрСостоянияКонфигурацийКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьРасширения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проблемная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонфигурацияКлиентаОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>Приложение</name>
      <type>
        <types>CatalogRef.ЦБР_ЗадачаПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/CommonModules/ЦБР_ОбзорДокумента/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ШаблонНовогоОписания()Экспорт
	
	HTMLТекст = "<!DOCTYPE html>
	|<head>
	|<style type=""text/css"">
	|body{
	|	margin:0;
	|	padding:8px;
	|	}
	|pre {
	|    background: #f4f4f4;
	|    border: 1px solid #ddd;
	|    border-left: 3px solid #f36d33;
	|    color: #666;
	|    page-break-inside: avoid;
	|    font-family: monospace;
	|    font-size: 15px;
	|    line-height: 1.6;
	|    margin-bottom: 1.6em;
	|    max-width: 100%;
	|    overflow: auto;
	|    padding: 1em 1.5em;
	|    display: block;
	|    word-wrap: break-word;
	|}	
	|	p {
	|      color: #000080;
	|      text-indent: 10px;
	|   }
	|</style>
	|</head>
	|<body>
	//|<p><b>Описание задачи:</b></p>
	//|<pre><code></code></pre>
	//|<p><b>Цель задачи:</b></p>
	//|<pre><code></code></pre>
	//|<p><b>Какой ждем результат:</b></p>
	|<pre><code></code></pre>
	|</body>
	|</html>";
	
	Возврат HTMLТекст;
КонецФункции

Функция ПолучитьОбзорПроекта(Форма) Экспорт
	
	Объект = Форма.Объект;
	ПредсогласованныеЧасы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(Объект.Ссылка);
	
	HTMLТекст = "<html>
	|<head>    
	|<meta charset=""UTF-8""/>
	|<title>Document</title>
	|<style type=""text/css"">
	|body {
	|overflow:    auto;
	|margin-top:  6px;
	|margin-left: 0px;
	|margin-bottom: 0px;
	|font-size:   10pt;}
	|
	|table { 
	|width: 100%; 
	|font-size: 10pt;
	|border-collapse: collapse;}
	|
	|.table_name { 
	|width: 100%; 
	|margin: 0px; 
	|font-size: 12pt;
	|background: #ffd300;
	|height: 30px;
	|width: 100%;}
	|.table_name tbody td {
	|text-align: left;
	|border: none;
	|padding: 10px 15px;
	|vertical-align: top;
	|}
	|
	|.table_dark {
	|width: 100%;
	|border: none;
	|margin-bottom: 20px;
	|}
	|.table_dark thead th {
	|font-weight: bold;
	|border: none;
	|padding: 10px 15px;
	|background: #d8d8d8;
	|}
	|.table_dark thead tr th:first-child {
	|border-radius: 8px 0 0 8px;
	|}
	|.table_dark thead tr th:last-child {
	|border-radius: 0 8px 8px 0;
	|}
	|.table_dark tbody td {
	|border: none;
	|padding: 10px 15px;
	|font-size: 14px;
	|vertical-align: top;
	|}
	|.table_dark tbody tr:nth-child(even){
	|background: #f3f3f3;
	|}
	|.table_dark tbody tr td:first-child {
	|border-radius: 8px 0 0 8px;
	|}
	|.table_dark tbody tr td:last-child {
	|border-radius: 0 8px 8px 0;
	|}				
	|
	|.table_bot {
	|margin-bottom: 20px;
	|border-collapse: collapse; 
	|}
	|
	|.table_bot td {
	|border: 1px solid #dddddd;
	|padding: 5px;
	|}
	|.table_bot tr td:first-child, .table tr th:first-child {
	|border-left: none;
	|}
	|.table_bot tr td:last-child, .table tr th:last-child {
	|border-right: none;
	|}
	|pre {
	|    background: #f4f4f4;
	|    border: 1px solid #ddd;
	|    border-left: 3px solid #f36d33;
	|    color: #666;
	|    page-break-inside: avoid;
	|    font-family: monospace;
	|    font-size: 15px;
	|    line-height: 1.6;
	|    margin-bottom: 1.6em;
	|    max-width: 100%;
	|    overflow: auto;
	|    padding: 1em 1.5em;
	|    display: block;
	|    word-wrap: break-word;
	|}
	|a:link {
	|color: #006699; text-decoration: none;}
	|a:visited {
	|color: #006699; text-decoration: none;}
	|a:hover {
	|color: #006699; text-decoration: underline;}
	|</style>
	|</head>
	|<body> ";     

	HTMLТекст = HTMLТекст + "<table class=""table_name"">
  							|<tbody>
      						|<td width=""70%""><B>Задача: </B>";
	Заголовок = Строка(Объект.ВидЗадачи) + ": " + Объект.Наименование;
	HTMLТекст = HTMLТекст + Заголовок;
		
	Если Объект.СсылкаBitrix <> "" Тогда
		HTMLТекст = HTMLТекст + " (<a href="+Объект.СсылкаBitrix+">";
		Заголовок = Строка(Объект.СсылкаBitrix);
		HTMLТекст = HTMLТекст + Заголовок;
		HTMLТекст = HTMLТекст + "</a>)";
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td>
      						|<td align=""right""><B>Состояние:</B> ";      
	СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Пользователи.АвторизованныйПользователь());
	HTMLТекст = HTMLТекст + СостояниеЗадачи;
	Если Объект.ПредСогласованныеЧасы > 0 Тогда
		HTMLТекст = HTMLТекст + " (предсогласованно "+Объект.ПредСогласованныеЧасы+" ч.)";
	КонецЕсли;
	HTMLТекст = HTMLТекст + "</td>
    						|</tr>
  							|</tbody>
							|</table><br>";                      
	
	Если СокрЛП(Объект.ОбратитьВнимание) <> "" Тогда
		HTMLТекст = HTMLТекст + "<B>ВАЖНО: </B>" + Объект.ОбратитьВнимание+ "<br>";
	КонецЕсли;
   #Область Конфигурации
   ОтборКонфигураций = Объект.Конфигурации.НайтиСтроки(Новый Структура("Выбрана", Истина));
   Если ОтборКонфигураций.Количество() > 0 Тогда
   
	   HTMLТекст = HTMLТекст + "<table class=""table_dark"">
	   |<thead>
	   |<tr>
	   |<th>Конфигурация</th>
	   |<th>Релиз</th>
	   |<th>Версия</th>
	   |<th>Актуальная</th>
	   |<th>Расширения</th>
	   |<th>Проблемная</th>
	   |<th>Комментарии</th>
	   |</tr>
	   |</thead>
	   |<tbody>";
	   Для Каждого Строка Из ОтборКонфигураций Цикл 
			HTMLТекст = HTMLТекст + "<tr><td>"+Строка.Конфигурация+"</td>";
			HTMLТекст = HTMLТекст + "<td align=""center"">"+Строка.Релиз+"</td>";
			HTMLТекст = HTMLТекст + "<td align=""center"">"+Строка.Версия+"</td>";
			Если Строка.СостояниеКонфигурации = Перечисления._центрСостоянияКонфигурацийКлиентов.Типовая Тогда
				HTMLТекст = HTMLТекст + "<td align=""center"">&#9989;</td>";
			Иначе     
				HTMLТекст = HTMLТекст + "<td align=""center"">&#33;</td>";
			КонецЕсли;
			Если Строка.ЕстьРасширения Тогда
				HTMLТекст = HTMLТекст + "<td align=""center"">&#9989;</td>";
			Иначе     
				HTMLТекст = HTMLТекст + "<td align=""center"">&#33;</td>";
			КонецЕсли;
			Если Строка.Проблемная Тогда
				HTMLТекст = HTMLТекст + "<td align=""center"">&#9989;</td>";
			Иначе     
				HTMLТекст = HTMLТекст + "<td align=""center"">&#33;</td>";
			КонецЕсли;
			HTMLТекст = HTMLТекст + "<td>"+Строка.КонфигурацияКлиентаОписание+"</td></tr>";
	   КонецЦикла;
	   HTMLТекст = HTMLТекст + "</tbody>
	   |</table>"; 
   КонецЕсли;
	#КонецОбласти
	
	 HTMLТекст = HTMLТекст + "&replace_text";

	
	#Область УчастникиЗадачи   
	HTMLТекст = HTMLТекст + "<table>
							|<tr>
							|<td>";    
	
	
	HTMLТекст = HTMLТекст + "<table  class=""table_bot"">
							|<tbody>
							|<tr>"; 
	
	HTMLТекст = HTMLТекст + "<td width=""15%"">Постановщик:</td>
							|<td width=""85%"" align=""left"">";
	ДобавитьВТекстДанныеКонтактногоЛица(Объект.Постановщик, HTMLТекст, "");								
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|<tr>";
	HTMLТекст = HTMLТекст + "<td>Заказчик:</td>
							|<td align=""left"">";
	ДобавитьВТекстДанныеКонтактногоЛица(Объект.Заказчик, HTMLТекст, "");								
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|<tr>";
	HTMLТекст = HTMLТекст + "<td>Контакт:</td>
							|<td align=""left"">";
	ДобавитьВТекстДанныеКонтактногоЛица(Объект.КонтактноеЛицо, HTMLТекст, "");
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|</tbody>
							|</table>";
	
	HTMLТекст = HTMLТекст + "</td>
							|<td>";

	HTMLТекст = HTMLТекст + "<table  class=""table_bot"">
							|<tbody>
							|<tr>
							|<td width=""30%"">Руководитель задачи:</td>
							|<td width=""70%"" align=""left"">";
	Отбор = Новый Структура;	
	Отбор.Вставить("Роль", Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи);
	НайденноеЗначение = Объект.Команда.НайтиСтроки(Отбор);
	Если НайденноеЗначение.Количество() Тогда
		ДобавитьРеквизит(HTMLТекст, , НайденноеЗначение[0].Исполнитель);	
	КонецЕсли;		
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|<tr>
							|<td>Куратор задачи:</td>
							|<td align=""left"">";
	Отбор = Новый Структура;	
	Отбор.Вставить("Роль", Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя);
	НайденноеЗначение = Объект.Команда.НайтиСтроки(Отбор);
	Если НайденноеЗначение.Количество() Тогда
		ДобавитьРеквизит(HTMLТекст, , НайденноеЗначение[0].Исполнитель);	
	КонецЕсли;	
	HTMLТекст = HTMLТекст + "</td>
							|</tr>   
	                        |<tr>
							|<td>Исполнитель:</td>
							|<td align=""left"">";
	СписокИсполнителей = Новый СписокЗначений;
	СписокИсполнителей.Добавить(Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик);
	СписокИсполнителей.Добавить(Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик);
	СписокИсполнителей.Добавить(Перечисления.ЦБР_РольВЗадаче.Исполнитель);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ЗадачаКоманда.Исполнитель
	|ИЗ
	|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
	|ГДЕ
	|	ЦБР_ЗадачаКоманда.Роль В (&СписокРолей)
	|	И ЦБР_ЗадачаКоманда.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокРолей", СписокИсполнителей);
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл  
		ДобавитьРеквизит(HTMLТекст, ,РезультатЗапроса.Исполнитель);	
	КонецЦикла;
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|</tbody>
							|</table>";
	
	
	
			
	HTMLТекст = HTMLТекст + "</td>
							|</tr>
							|</table>";	
	#КонецОбласти          
	
	HTMLТекст = HTMLТекст + "</body></html>";
	Возврат HTMLТекст;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПодпись(HTMLТекст, Подпись)
	
	Если ЗначениеЗаполнено(Подпись) Тогда 
		HTMLТекст = HTMLТекст + "<FONT color=#413003>";
		HTMLТекст = HTMLТекст + Подпись + " ";
		HTMLТекст = HTMLТекст + "</FONT>";
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗначение(HTMLТекст, ЗначениеДанных, Цвет = "")
	
	Значение = ЗначениеДанных;
	
	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение))
		Или ОбщегоНазначения.ЭтоПеречисление(Значение.Метаданные()) Тогда 
		Если ЗначениеЗаполнено(Цвет) Тогда 
			HTMLТекст = HTMLТекст + "<FONT color=#"+Цвет+">";
			HTMLТекст = HTMLТекст + ЗаменитьСпецСимволыHTML(Значение);
			HTMLТекст = HTMLТекст + "</FONT>";
		Иначе	
			HTMLТекст = HTMLТекст + ЗаменитьСпецСимволыHTML(Значение);
		КонецЕсли;
	Иначе
		HTMLТекст = HTMLТекст + СтрШаблон(
		"<A href=v8doc:%1>%2</A>",
		ПолучитьНавигационнуюСсылку(Значение),
		ЗаменитьСпецСимволыHTML(Строка(Значение)));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизит(HTMLТекст, Подпись, Значение, Цвет = "")
	
	ДобавитьПодпись(HTMLТекст, Подпись);
	ДобавитьЗначение(HTMLТекст, Значение, Цвет); 
	HTMLТекст = HTMLТекст + "<br>";
	
КонецПроцедуры

// Добавляет в текст HTML данные контактного лица
Процедура ДобавитьВТекстДанныеКонтактногоЛица(КонтактноеЛицо, HTMLТекст, ЗаголовокКонтактногоЛица = "")
	
	Если Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьРеквизит(HTMLТекст, ЗаголовокКонтактногоЛица, КонтактноеЛицо);
	КонтактнаяИнформация = ПолучитьКонтактнуюИнформацияОбъекта(КонтактноеЛицо);
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация.Телефон) Тогда
		ДобавитьРеквизит(HTMLТекст, "", КонтактнаяИнформация.Телефон, "696969");
	КонецЕсли;
	//
	Если ЗначениеЗаполнено(КонтактнаяИнформация.Емайл) Тогда 
		ДобавитьРеквизит(HTMLТекст, "", КонтактнаяИнформация.Емайл, "696969");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКонтактнуюИнформацияОбъекта(Пользователь)
	
	КонтактнаяИнформация = Новый Структура;
	Емайл = "";Телефон = "";
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Емайл = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.EmailПользователя,,
		ТекущаяДатаСеанса());
		Телефон = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,,
		ТекущаяДатаСеанса());
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Емайл = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица,,
		ТекущаяДатаСеанса());
		Телефон = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица,,
		ТекущаяДатаСеанса());
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.Контрагенты") Тогда
		Емайл = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,,
		ТекущаяДатаСеанса());
		Телефон = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Пользователь,
		Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,,
		ТекущаяДатаСеанса());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Телефон) Тогда 
		КонтактнаяИнформация.Вставить("Телефон", СтрШаблон(
		НСтр("ru = 'Телефон: %1'"), Телефон));	
	Иначе
		КонтактнаяИнформация.Вставить("Телефон", Телефон);
	КонецЕсли;			
	
	КонтактнаяИнформация.Вставить("Емайл", Емайл);
	
	Возврат КонтактнаяИнформация;
	
КонецФункции	

// Заменяет в строке все спецсимволы на соответствующие им имена,
// возвращает измененную строку.
//
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-parameter-section
Функция ЗаменитьСпецСимволыHTML(Строка, СпецСимволыСоотв = Неопределено) Экспорт
	
	СоответствиеСпецСимволов = ПолучитьСоответствиеСпецСимволов();
	
	ЗаменитьСпецСимволHTML(Строка, 38, "amp");
	
	НоваяСтрока = "";
	
	Для Поз = 1 По СтрДлина(Строка) Цикл
		
		Код = КодСимвола(Строка, Поз);
		ИмяСимвола = СоответствиеСпецСимволов.Получить(Код);
		
		Если ИмяСимвола = Неопределено Тогда
			НоваяСтрока = НоваяСтрока + Символ(Код);
		Иначе
			НоваяСтрока = НоваяСтрока + "&" + ИмяСимвола + ";";
		КонецЕсли;
		
	КонецЦикла;
	
	Строка = НоваяСтрока;
	
	Возврат Строка;
	
КонецФункции

Процедура ЗаменитьСпецСимволHTML(Строка, КодСимвола, ИмяСимвола)
	
	Строка = СтрЗаменить(Строка, Символ(КодСимвола), "&" + ИмяСимвола + ";");
	
КонецПроцедуры

// Возвращает соответствие для замены спецсимволов
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСоответствиеСпецСимволов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(193, "Aacute");
	Результат.Вставить(225, "aacute");
	Результат.Вставить(226, "acirc");
	Результат.Вставить(194, "Acirc");
	Результат.Вставить(180, "acute");
	Результат.Вставить(230, "aelig");
	Результат.Вставить(198, "AElig");
	Результат.Вставить(192, "Agrave");
	Результат.Вставить(224, "agrave");
	Результат.Вставить(8501, "alefsym");
	Результат.Вставить(913, "Alpha");
	Результат.Вставить(945, "alpha");
	Результат.Вставить(8743, "and");
	Результат.Вставить(8736, "ang");
	Результат.Вставить(229, "aring");
	Результат.Вставить(197, "Aring");
	Результат.Вставить(8776, "asymp");
	Результат.Вставить(195, "Atilde");
	Результат.Вставить(227, "atilde");
	Результат.Вставить(196, "Auml");
	Результат.Вставить(228, "auml");
	Результат.Вставить(8222, "bdquo");
	Результат.Вставить(914, "Beta");
	Результат.Вставить(946, "beta");
	Результат.Вставить(166, "brvbar");
	Результат.Вставить(8226, "bull");
	Результат.Вставить(8745, "cap");
	Результат.Вставить(199, "Ccedil");
	Результат.Вставить(231, "ccedil");
	Результат.Вставить(184, "cedil");
	Результат.Вставить(162, "cent");
	Результат.Вставить(967, "chi");
	Результат.Вставить(935, "Chi");
	Результат.Вставить(710, "circ");
	Результат.Вставить(9827, "clubs");
	Результат.Вставить(8773, "cong");
	Результат.Вставить(169, "copy");
	Результат.Вставить(8629, "crarr");
	Результат.Вставить(8746, "cup");
	Результат.Вставить(164, "curren");
	Результат.Вставить(8224, "dagger");
	Результат.Вставить(8225, "Dagger");
	Результат.Вставить(8659, "dArr");
	Результат.Вставить(8595, "darr");
	Результат.Вставить(176, "deg");
	Результат.Вставить(916, "Delta");
	Результат.Вставить(948, "delta");
	Результат.Вставить(9830, "diams");
	Результат.Вставить(247, "divide");
	Результат.Вставить(233, "eacute");
	Результат.Вставить(201, "Eacute");
	Результат.Вставить(202, "Ecirc");
	Результат.Вставить(234, "ecirc");
	Результат.Вставить(232, "egrave");
	Результат.Вставить(200, "Egrave");
	Результат.Вставить(8709, "empty");
	Результат.Вставить(8195, "emsp");
	Результат.Вставить(8194, "ensp");
	Результат.Вставить(949, "epsilon");
	Результат.Вставить(917, "Epsilon");
	Результат.Вставить(8801, "equiv");
	Результат.Вставить(919, "Eta");
	Результат.Вставить(951, "eta");
	Результат.Вставить(240, "eth");
	Результат.Вставить(208, "ETH");
	Результат.Вставить(235, "euml");
	Результат.Вставить(203, "Euml");
	Результат.Вставить(8364, "euro");
	Результат.Вставить(8707, "exist");
	Результат.Вставить(402, "fnof");
	Результат.Вставить(8704, "forall");
	Результат.Вставить(189, "frac12");
	Результат.Вставить(188, "frac14");
	Результат.Вставить(190, "frac34");
	Результат.Вставить(8260, "frasl");
	Результат.Вставить(915, "Gamma");
	Результат.Вставить(947, "gamma");
	Результат.Вставить(8805, "ge");
	Результат.Вставить(62, "gt");
	Результат.Вставить(8660, "hArr");
	Результат.Вставить(8596, "harr");
	Результат.Вставить(9829, "hearts");
	Результат.Вставить(8230, "hellip");
	Результат.Вставить(237, "iacute");
	Результат.Вставить(205, "Iacute");
	Результат.Вставить(238, "icirc");
	Результат.Вставить(206, "Icirc");
	Результат.Вставить(161, "iexcl");
	Результат.Вставить(204, "Igrave");
	Результат.Вставить(236, "igrave");
	Результат.Вставить(8465, "image");
	Результат.Вставить(8734, "infin");
	Результат.Вставить(8747, "int");
	Результат.Вставить(921, "Iota");
	Результат.Вставить(953, "iota");
	Результат.Вставить(191, "iquest");
	Результат.Вставить(8712, "isin");
	Результат.Вставить(207, "Iuml");
	Результат.Вставить(239, "iuml");
	Результат.Вставить(922, "Kappa");
	Результат.Вставить(954, "kappa");
	Результат.Вставить(955, "lambda");
	Результат.Вставить(923, "Lambda");
	Результат.Вставить(9001, "lang");
	Результат.Вставить(171, "laquo");
	Результат.Вставить(8592, "larr");
	Результат.Вставить(8656, "lArr");
	Результат.Вставить(8968, "lceil");
	Результат.Вставить(8220, "ldquo");
	Результат.Вставить(8804, "le");
	Результат.Вставить(8970, "lfloor");
	Результат.Вставить(8727, "lowast");
	Результат.Вставить(9674, "loz");
	Результат.Вставить(8206, "lrm");
	Результат.Вставить(8249, "lsaquo");
	Результат.Вставить(8216, "lsquo");
	Результат.Вставить(60, "lt");
	Результат.Вставить(175, "macr");
	Результат.Вставить(8212, "mdash");
	Результат.Вставить(181, "micro");
	Результат.Вставить(183, "middot");
	Результат.Вставить(8722, "minus");
	Результат.Вставить(924, "Mu");
	Результат.Вставить(956, "mu");
	Результат.Вставить(8711, "nabla");
	Результат.Вставить(160, "nbsp");
	Результат.Вставить(8211, "ndash");
	Результат.Вставить(8800, "ne");
	Результат.Вставить(8715, "ni");
	Результат.Вставить(172, "not");
	Результат.Вставить(8713, "notin");
	Результат.Вставить(8836, "nsub");
	Результат.Вставить(241, "ntilde");
	Результат.Вставить(209, "Ntilde");
	Результат.Вставить(925, "Nu");
	Результат.Вставить(957, "nu");
	Результат.Вставить(243, "oacute");
	Результат.Вставить(211, "Oacute");
	Результат.Вставить(212, "Ocirc");
	Результат.Вставить(244, "ocirc");
	Результат.Вставить(338, "OElig");
	Результат.Вставить(339, "oelig");
	Результат.Вставить(242, "ograve");
	Результат.Вставить(210, "Ograve");
	Результат.Вставить(8254, "oline");
	Результат.Вставить(969, "omega");
	Результат.Вставить(937, "Omega");
	Результат.Вставить(927, "Omicron");
	Результат.Вставить(959, "omicron");
	Результат.Вставить(8853, "oplus");
	Результат.Вставить(8744, "or");
	Результат.Вставить(170, "ordf");
	Результат.Вставить(186, "ordm");
	Результат.Вставить(216, "Oslash");
	Результат.Вставить(248, "oslash");
	Результат.Вставить(213, "Otilde");
	Результат.Вставить(245, "otilde");
	Результат.Вставить(8855, "otimes");
	Результат.Вставить(214, "Ouml");
	Результат.Вставить(246, "ouml");
	Результат.Вставить(182, "para");
	Результат.Вставить(8706, "part");
	Результат.Вставить(8240, "permil");
	Результат.Вставить(8869, "perp");
	Результат.Вставить(966, "phi");
	Результат.Вставить(934, "Phi");
	Результат.Вставить(928, "Pi");
	Результат.Вставить(960, "pi");
	Результат.Вставить(982, "piv");
	Результат.Вставить(177, "plusmn");
	Результат.Вставить(163, "pound");
	Результат.Вставить(8243, "Prime");
	Результат.Вставить(8242, "prime");
	Результат.Вставить(8719, "prod");
	Результат.Вставить(8733, "prop");
	Результат.Вставить(968, "psi");
	Результат.Вставить(936, "Psi");
	Результат.Вставить(34, "quot");
	Результат.Вставить(8730, "radic");
	Результат.Вставить(9002, "rang");
	Результат.Вставить(187, "raquo");
	Результат.Вставить(8658, "rArr");
	Результат.Вставить(8594, "rarr");
	Результат.Вставить(8969, "rceil");
	Результат.Вставить(8221, "rdquo");
	Результат.Вставить(8476, "real");
	Результат.Вставить(174, "reg");
	Результат.Вставить(8971, "rfloor");
	Результат.Вставить(929, "Rho");
	Результат.Вставить(961, "rho");
	Результат.Вставить(8207, "rlm");
	Результат.Вставить(8250, "rsaquo");
	Результат.Вставить(8217, "rsquo");
	Результат.Вставить(8218, "sbquo");
	Результат.Вставить(352, "Scaron");
	Результат.Вставить(353, "scaron");
	Результат.Вставить(8901, "sdot");
	Результат.Вставить(167, "sect");
	Результат.Вставить(173, "shy");
	Результат.Вставить(931, "Sigma");
	Результат.Вставить(963, "sigma");
	Результат.Вставить(962, "sigmaf");
	Результат.Вставить(8764, "sim");
	Результат.Вставить(9824, "spades");
	Результат.Вставить(8834, "sub");
	Результат.Вставить(8838, "sube");
	Результат.Вставить(8721, "sum");
	Результат.Вставить(8835, "sup");
	Результат.Вставить(185, "sup1");
	Результат.Вставить(178, "sup2");
	Результат.Вставить(179, "sup3");
	Результат.Вставить(8839, "supe");
	Результат.Вставить(223, "szlig");
	Результат.Вставить(932, "Tau");
	Результат.Вставить(964, "tau");
	Результат.Вставить(8756, "there4");
	Результат.Вставить(920, "Theta");
	Результат.Вставить(952, "theta");
	Результат.Вставить(977, "thetasym");
	Результат.Вставить(8201, "thinsp");
	Результат.Вставить(222, "THORN");
	Результат.Вставить(254, "thorn");
	Результат.Вставить(732, "tilde");
	Результат.Вставить(215, "times");
	Результат.Вставить(8482, "trade");
	Результат.Вставить(250, "uacute");
	Результат.Вставить(218, "Uacute");
	Результат.Вставить(8657, "uArr");
	Результат.Вставить(8593, "uarr");
	Результат.Вставить(251, "ucirc");
	Результат.Вставить(219, "Ucirc");
	Результат.Вставить(217, "Ugrave");
	Результат.Вставить(249, "ugrave");
	Результат.Вставить(168, "uml");
	Результат.Вставить(978, "upsih");
	Результат.Вставить(965, "upsilon");
	Результат.Вставить(933, "Upsilon");
	Результат.Вставить(252, "uuml");
	Результат.Вставить(220, "Uuml");
	Результат.Вставить(8472, "weierp");
	Результат.Вставить(958, "xi");
	Результат.Вставить(926, "Xi");
	Результат.Вставить(253, "yacute");
	Результат.Вставить(221, "Yacute");
	Результат.Вставить(165, "yen");
	Результат.Вставить(255, "yuml");
	Результат.Вставить(376, "Yuml");
	Результат.Вставить(918, "Zeta");
	Результат.Вставить(950, "zeta");
	Результат.Вставить(8205, "zwj");
	Результат.Вставить(8204, "zwnj");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
